snlkuharlocal/src/DataProcessors/СравнитьОстаткиВзаиморасчетов/СравнитьОстаткиВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СравнитьОстаткиВзаиморасчетов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Файл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Остатки</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <comment>Сумма в рублях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <comment>Сумма в валюте расчетов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сравнение</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <comment>Сумма в рублях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <comment>Сумма в валюте расчетов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВалПриемник</name>
      <comment>Сумма в рублях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпрПриемник</name>
      <comment>Сумма в валюте расчетов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаСравнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/DataProcessors/СравнитьОстаткиВзаиморасчетов/Forms/Форма/Module.bsl
//////////////////////////////////////////////////////////////////////////
//  ВЫГРУЗКА
//////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Выберите файл JSON";
	Диалог.ПолноеИмяФайла = ""; 
	Диалог.Фильтр = "JSON (*.json)|*.json";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = КаталогВременныхФайлов();
	
	Если Диалог.Выбрать() Тогда
		Объект.Файл = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	
	Если ПустаяСтрока(Объект.Файл) Тогда
		Сообщить("Не выбран файл JSON");
		Возврат;
	КонецЕсли;
	
	Если Объект.Остатки.Количество() = 0 Тогда
		Сообщить("Не заполнена ТЧ <Остатки>.");
		Возврат;
	КонецЕсли;
	
	МассивДанных = Новый Массив;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(Объект.Файл,,, Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб));
	
	Для Каждого Стр ИЗ Объект.Остатки Цикл
		СтруктураДанных = Новый Структура("КонтрагентУИД, КонтрагентНаименование, ДоговорУИД, ДоговорНаименование, СуммаВал, СуммаУпр",
			Строка(Стр.Контрагент.УникальныйИдентификатор()), СокрЛП(Стр.Контрагент.Наименование),
			Строка(Стр.Договор.УникальныйИдентификатор()), СокрЛП(Стр.Договор.Наименование),
			Стр.СуммаВал, Стр.СуммаУпр);
			
		МассивДанных.Добавить(СтруктураДанных);
	КонецЦикла;
	
	ЗаписатьJSON(ЗаписьJSON,МассивДанных); 
	
	ЗаписьJSON.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОстаткиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ?(НЕ ЗначениеЗаполнено(Объект.Период), ТекущаяДатаСеанса(), Объект.Период));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Контрагент КАК Контрагент,
	|	Остатки.Договор КАК Договор,
	|	ВЫРАЗИТЬ(Остатки.СуммаВалОстаток КАК ЧИСЛО(19, 2)) КАК СуммаВал,
	|	ВЫРАЗИТЬ(Остатки.СуммаУпрОстаток КАК ЧИСЛО(19, 2)) КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Период, ) КАК Остатки";
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗВыборка = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Объект.Остатки.Загрузить(ТЗВыборка);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОстатки(Команда)
	СформироватьОстаткиНаСервере();
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
//  ЗАГРУЗКА
//////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл JSON";
	Диалог.ПолноеИмяФайла = ""; 
	Диалог.Фильтр = "JSON (*.json)|*.json";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = КаталогВременныхФайлов();
	
	Если Диалог.Выбрать() Тогда
		Объект.Файл = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Если ПустаяСтрока(Объект.Файл) Тогда
		Сообщить("Не выбран файл JSON");
		Возврат;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(Объект.Файл);
	МассивДанных = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Объект.Сравнение.Очистить();
	Для Каждого Стр ИЗ МассивДанных Цикл
		НоваяСтрока = Объект.Сравнение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		НоваяСтрока.Контрагент = Обработки.СравнитьОстаткиВзаиморасчетов.НайтиОбъектКонфигурацииПоУИД(НоваяСтрока.КонтрагентУИД, "Справочник", "Контрагенты");
		НоваяСтрока.Договор = Обработки.СравнитьОстаткиВзаиморасчетов.НайтиОбъектКонфигурацииПоУИД(НоваяСтрока.ДоговорУИД, "Справочник", "Договоры");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сравнить(Команда)
	
	Если Объект.Сравнение.Количество() = 0 Тогда
		Сообщить("Не заполнена ТЧ <Сравнение>.");
		Возврат;
	КонецЕсли;
	
	СравнитьНаСервере();
	СравнениеИсточникаИПриемника();
	
КонецПроцедуры

&НаСервере
Процедура СравнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ?(НЕ ЗначениеЗаполнено(Объект.Период), ТекущаяДатаСеанса(), Объект.Период));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Контрагент КАК Контрагент,
	|	Остатки.Договор КАК Договор,
	|	ВЫРАЗИТЬ(Остатки.СуммаВалОстаток КАК ЧИСЛО(19, 2)) КАК СуммаВалПриемник,
	|	ВЫРАЗИТЬ(Остатки.СуммаУпрОстаток КАК ЧИСЛО(19, 2)) КАК СуммаУпрПриемник
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Период, ) КАК Остатки";
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗВыборка = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого Стр ИЗ ТЗВыборка Цикл
		
		НайденныеСтроки = Объект.Сравнение.НайтиСтроки(Новый Структура("Контрагент, Договор", Стр.Контрагент, Стр.Договор));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого СтрН ИЗ НайденныеСтроки Цикл
				СтрН.СуммаВалПриемник = Стр.СуммаВалПриемник;
				СтрН.СуммаУпрПриемник = Стр.СуммаУпрПриемник;
			КонецЦикла;
		Иначе
			НоваяСтрока = Объект.Сравнение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			НоваяСтрока.КонтрагентУИД = Строка(Стр.Контрагент.УникальныйИдентификатор());
			НоваяСтрока.ДоговорУИД = Строка(Стр.Договор.УникальныйИдентификатор());
			НоваяСтрока.КонтрагентНаименование = СокрЛП(Стр.Контрагент.Наименование);
			НоваяСтрока.ДоговорНаименование = СокрЛП(Стр.Договор.Наименование);
			НоваяСтрока.СтрокаСравнения = "Только в базе-приемнике";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СравнениеИсточникаИПриемника()
	
	Для Каждого Стр ИЗ Объект.Сравнение Цикл
		
		Если ПустаяСтрока(Стр.СтрокаСравнения) Тогда
			
			Если Стр.СуммаУпрПриемник <> 0 И Стр.СуммаУпр <> 0 И Стр.СуммаУпрПриемник <> Стр.СуммаУпр Тогда
				Стр.СтрокаСравнения = "Отличаются Суммы вал. источника и приемника";
			КонецЕсли;
			Если Стр.СуммаВалПриемник <> 0 И Стр.СуммаВал <> 0 И Стр.СуммаВалПриемник <> Стр.СуммаВал Тогда
				Стр.СтрокаСравнения = "Отличаются Суммы в руб. источника и приемника";
			КонецЕсли;
			Если Стр.СуммаУпрПриемник = 0 ИЛИ Стр.СуммаВалПриемник = 0 Тогда
				Стр.СтрокаСравнения = "Не найдены суммы в приемнике";	
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Цвет раскраски строк
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	
	// Условия раскраски
    ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Сравнение.СуммаВал");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
    ЭлементОтбора.ПравоеЗначение = 0;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Сравнение.СуммаВалПриемник");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
    ЭлементОтбора.ПравоеЗначение = 0;
	ЭлементОтбора.Использование = Истина;
	
	//ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Сравнение.СуммаВал");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	//ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Сравнение.СуммаВалПриемник");
	//ЭлементОтбора.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
КонецПроцедуры
